// GENERATED FROM MinDev KATOttG codifier (xlsx).
// Oblast: Луганська (code: UA44000000000018893)


import '../../models/admin_units.dart';

/// Територіальні громади області «Луганська» (без м. Київ та АР Крим).
/// raionUid = код району (КАТОТТГ, 2-й рівень).
/// uid = код громади (КАТОТТГ, 3-й рівень).
const List<Hromada> luhanskaOblastHromadas = [

  //! Не враховуємо
  // Алчевський район (raion_1803)
  // Hromada(uid: 'UA44020010000067642', raionUid: 'raion_1803', title: 'Алчевська територіальна громада'),
  // Hromada(uid: 'UA44020030000055937', raionUid: 'raion_1803', title: 'Зимогір’ївська територіальна громада'),
  // Hromada(uid: 'UA44020050000061272', raionUid: 'raion_1803', title: 'Кадіївська територіальна громада'),

  // Довжанський район (UA44040000000032820)
  // Hromada(uid: 'UA44040010000091230', raionUid: 'UA44040000000032820', title: 'Довжанська територіальна громада'),
  // Hromada(uid: 'UA44040030000034083', raionUid: 'UA44040000000032820', title: 'Сорокинська територіальна громада'),

  // Луганський район (UA44060000000048093)
  // Hromada(uid: 'UA44060010000059164', raionUid: 'UA44060000000048093', title: 'Луганська територіальна громада'),
  // Hromada(uid: 'UA44060030000019360', raionUid: 'UA44060000000048093', title: 'Лутугинська територіальна громада'),
  // Hromada(uid: 'UA44060050000028333', raionUid: 'UA44060000000048093', title: 'Молодогвардійська територіальна громада'),

  // Ровеньківський район (UA44080000000045512)
  // Hromada(uid: 'UA44080010000030435', raionUid: 'UA44080000000045512', title: 'Антрацитівська територіальна громада'),
  // Hromada(uid: 'UA44080030000048115', raionUid: 'UA44080000000045512', title: 'Ровеньківська територіальна громада'),
  // Hromada(uid: 'UA44080050000055882', raionUid: 'UA44080000000045512', title: 'Хрустальненська територіальна громада'),


  //! Існуючі райони, дійсні станом на 2026 рік
  // Сватівський район (raion_85)
  Hromada(uid: 'UA44100010000048313', raionUid: 'raion_85', title: 'Білокуракинська територіальна громада'),
  Hromada(uid: 'UA44100030000094890', raionUid: 'raion_85', title: 'Коломийчиська територіальна громада'),
  Hromada(uid: 'UA44100050000027880', raionUid: 'raion_85', title: 'Красноріченська територіальна громада'),
  Hromada(uid: 'UA44100070000070448', raionUid: 'raion_85', title: 'Лозно-Олександрівська територіальна громада'),
  Hromada(uid: 'UA44100090000087782', raionUid: 'raion_85', title: 'Нижньодуванська територіальна громада'),
  Hromada(uid: 'UA44100110000061602', raionUid: 'raion_85', title: 'Сватівська територіальна громада'),
  Hromada(uid: 'UA44100130000017965', raionUid: 'raion_85', title: 'Троїцька територіальна громада'),

  // Сіверськодонецький район (raion_84)
  Hromada(uid: 'UA44120010000044132', raionUid: 'raion_84', title: 'Гірська територіальна громада'),
  Hromada(uid: 'UA44120030000094047', raionUid: 'raion_84', title: 'м. Кремінна та Кремінська територіальна громада'),
  Hromada(uid: 'UA44120050000066819', raionUid: 'raion_84', title: 'м. Лисичанськ та Лисичанська територіальна громада'),
  Hromada(uid: 'UA44120070000073915', raionUid: 'raion_84', title: 'Попаснянська територіальна громада'),
  Hromada(uid: 'UA44120090000062828', raionUid: 'raion_84', title: 'м. Рубіжне та Рубіжанська територіальна громада'),
  Hromada(uid: 'UA44120110000010163', raionUid: 'raion_84', title: 'м. Сіверськодонецьк та Сіверськодонецька територіальна громада'),

  // Старобільський район (raion_86)
  Hromada(uid: 'UA44140010000036188', raionUid: 'raion_86', title: 'Біловодська територіальна громада'),
  Hromada(uid: 'UA44140030000070201', raionUid: 'raion_86', title: 'Білолуцька територіальна громада'),
  Hromada(uid: 'UA44140050000026566', raionUid: 'raion_86', title: 'Марківська територіальна громада'),
  Hromada(uid: 'UA44140070000058445', raionUid: 'raion_86', title: 'Міловська територіальна громада'),
  Hromada(uid: 'UA44140090000072167', raionUid: 'raion_86', title: 'Новопсковська територіальна громада'),
  Hromada(uid: 'UA44140110000056578', raionUid: 'raion_86', title: 'Старобільська територіальна громада'),
  Hromada(uid: 'UA44140130000089782', raionUid: 'raion_86', title: 'Чмирівська територіальна громада'),
  Hromada(uid: 'UA44140150000072734', raionUid: 'raion_86', title: 'Шульгинська територіальна громада'),

  // Щастинський район (raion_87)
  Hromada(uid: 'UA44160010000053248', raionUid: 'raion_87', title: 'Нижньотеплівська територіальна громада'),
  Hromada(uid: 'UA44160030000020916', raionUid: 'raion_87', title: 'Новоайдарська територіальна громада'),
  Hromada(uid: 'UA44160050000040019', raionUid: 'raion_87', title: 'Станично-Луганська територіальна громада'),
  Hromada(uid: 'UA44160070000013725', raionUid: 'raion_87', title: 'Широківська територіальна громада'),
  Hromada(uid: 'UA44160090000075695', raionUid: 'raion_87', title: 'Щастинська територіальна громада'),
];
